In [ ]:
# row with index 1 and all the columns

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("first.csv")
df

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2018,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,691859,ANZSIC06 divisions A-S (excluding classes K633...
1,2018,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,605766,ANZSIC06 divisions A-S (excluding classes K633...
2,2018,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,63509,ANZSIC06 divisions A-S (excluding classes K633...
3,2018,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,22583,ANZSIC06 divisions A-S (excluding classes K633...
4,2018,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,597623,ANZSIC06 divisions A-S (excluding classes K633...
...,...,...,...,...,...,...,...,...,...,...
27805,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
27806,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
27807,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
27808,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
27809,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [3]:
df.iloc[1,:]

Year                                                                        2018
Industry_aggregation_NZSIOC                                              Level 1
Industry_code_NZSIOC                                                       99999
Industry_name_NZSIOC                                              All industries
Units                                                         Dollars (millions)
Variable_code                                                                H04
Variable_name                    Sales, government funding, grants and subsidies
Variable_category                                          Financial performance
Value                                                                     605766
Industry_code_ANZSIC06         ANZSIC06 divisions A-S (excluding classes K633...
Name: 1, dtype: object

In [4]:
df.loc[25,:]

Year                                                                        2018
Industry_aggregation_NZSIOC                                              Level 1
Industry_code_NZSIOC                                                       99999
Industry_name_NZSIOC                                              All industries
Units                                                                    Dollars
Variable_code                                                                H35
Variable_name                                         Surplus per employee count
Variable_category                                               Financial ratios
Value                                                                      53600
Industry_code_ANZSIC06         ANZSIC06 divisions A-S (excluding classes K633...
Name: 25, dtype: object

In [5]:
# row with index l and column with index 1
df.iloc[1,1]

'Level 1'

In [6]:
df.loc[25,"Year"]

2018

In [7]:
# row with index 1 and column with index 1,2
df.iloc[1,1:3]

Industry_aggregation_NZSIOC    Level 1
Industry_code_NZSIOC             99999
Name: 1, dtype: object

In [9]:
df.loc[25,"Year":"Variable_name"]

Year                                                 2018
Industry_aggregation_NZSIOC                       Level 1
Industry_code_NZSIOC                                99999
Industry_name_NZSIOC                       All industries
Units                                             Dollars
Variable_code                                         H35
Variable_name                  Surplus per employee count
Name: 25, dtype: object

In [10]:
# row with indices 1,2,3
# columns with indices 1,2
df.loc[25:40,:]

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
25,2018,Level 1,99999,All industries,Dollars,H35,Surplus per employee count,Financial ratios,53600,ANZSIC06 divisions A-S (excluding classes K633...
26,2018,Level 1,99999,All industries,Percentage,H36,Current ratio,Financial ratios,77,ANZSIC06 divisions A-S (excluding classes K633...
27,2018,Level 1,99999,All industries,Percentage,H37,Quick ratio,Financial ratios,69,ANZSIC06 divisions A-S (excluding classes K633...
28,2018,Level 1,99999,All industries,Percentage,H39,Return on equity,Financial ratios,14,ANZSIC06 divisions A-S (excluding classes K633...
29,2018,Level 1,99999,All industries,Percentage,H40,Return on total assets,Financial ratios,5,ANZSIC06 divisions A-S (excluding classes K633...
30,2018,Level 1,99999,All industries,Percentage,H41,Liabilities structure,Financial ratios,34,ANZSIC06 divisions A-S (excluding classes K633...
31,2018,Level 1,AA,"Agriculture, Forestry and Fishing",Dollars (millions),H01,Total income,Financial performance,44753,ANZSIC06 division A
32,2018,Level 1,AA,"Agriculture, Forestry and Fishing",Dollars (millions),H04,Sales of goods and services,Financial performance,41108,ANZSIC06 division A
33,2018,Level 1,AA,"Agriculture, Forestry and Fishing",Dollars (millions),H05,"Interest, dividends and donations",Financial performance,540,ANZSIC06 division A
34,2018,Level 1,AA,"Agriculture, Forestry and Fishing",Dollars (millions),H06,"Government funding, grants and subsidies",Financial performance,12,ANZSIC06 division A
35,2018,Level 1,AA,"Agriculture, Forestry and Fishing",Dollars (millions),H07,Non-operating income,Financial performance,3093,ANZSIC06 division A
36,2018,Level 1,AA,"Agriculture, Forestry and Fishing",Dollars (millions),H08,Total expenditure,Financial performance,36651,ANZSIC06 division A
37,2018,Level 1,AA,"Agriculture, Forestry and Fishing",Dollars (millions),H09,Interest and donations,Financial performance,2860,ANZSIC06 division A
38,2018,Level 1,AA,"Agriculture, Forestry and Fishing",Dollars (millions),H10,Indirect taxes,Financial performance,451,ANZSIC06 division A
39,2018,Level 1,AA,"Agriculture, Forestry and Fishing",Dollars (millions),H11,Depreciation,Financial performance,1963,ANZSIC06 division A
40,2018,Level 1,AA,"Agriculture, Forestry and Fishing",Dollars (millions),H12,Salaries and wages paid,Financial performance,5283,ANZSIC06 division A

In [11]:
df.iloc[1:4,:]

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
1,2018,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,605766,ANZSIC06 divisions A-S (excluding classes K633...
2,2018,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,63509,ANZSIC06 divisions A-S (excluding classes K633...
3,2018,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,22583,ANZSIC06 divisions A-S (excluding classes K633...

### Boolean indexing

In [12]:
df.dtypes

Year                            int64
Industry_aggregation_NZSIOC    object
Industry_code_NZSIOC           object
Industry_name_NZSIOC           object
Units                          object
Variable_code                  object
Variable_name                  object
Variable_category              object
Value                          object
Industry_code_ANZSIC06         object
dtype: object

In [13]:
df.dtypes == object

Year                           False
Industry_aggregation_NZSIOC     True
Industry_code_NZSIOC            True
Industry_name_NZSIOC            True
Units                           True
Variable_code                   True
Variable_name                   True
Variable_category               True
Value                           True
Industry_code_ANZSIC06          True
dtype: bool

In [15]:
df.loc[:,df.dtypes == object]

,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,691859,ANZSIC06 divisions A-S (excluding classes K633...
1,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,605766,ANZSIC06 divisions A-S (excluding classes K633...
2,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,63509,ANZSIC06 divisions A-S (excluding classes K633...
3,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,22583,ANZSIC06 divisions A-S (excluding classes K633...
4,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,597623,ANZSIC06 divisions A-S (excluding classes K633...
...,...,...,...,...,...,...,...,...,...
27805,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
27806,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
27807,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
27808,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
27809,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [16]:
df.dtypes == np.int64

Year                            True
Industry_aggregation_NZSIOC    False
Industry_code_NZSIOC           False
Industry_name_NZSIOC           False
Units                          False
Variable_code                  False
Variable_name                  False
Variable_category              False
Value                          False
Industry_code_ANZSIC06         False
dtype: bool

In [17]:
df.iloc[:,df.dtypes == np.int64]# we cann't use boolean indexing with iloc

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [18]:
df.Variable_name

0                                           Total income
1        Sales, government funding, grants and subsidies
2                      Interest, dividends and donations
3                                   Non-operating income
4                                      Total expenditure
                              ...
27805                                        Quick ratio
27806                Margin on sales of goods for resale
27807                                   Return on equity
27808                             Return on total assets
27809                              Liabilities structure
Name: Variable_name, Length: 27810, dtype: object

In [19]:
df.Variable_name.nunique()

41

In [20]:
df.Variable_name.unique()

array(['Total income', 'Sales, government funding, grants and subsidies',
       'Interest, dividends and donations', 'Non-operating income',
       'Total expenditure', 'Interest and donations', 'Indirect taxes',
       'Depreciation', 'Salaries and wages paid',
       'Redundancy and severance',
       'Salaries and wages to self employed commission agents',
       'Purchases and other operating expenses', 'Non-operating expenses',
       'Opening stocks', 'Closing stocks', 'Surplus before income tax',
       'Total assets', 'Current assets', 'Fixed tangible assets',
       'Other assets', 'Total equity and liabilities',
       'Shareholders funds or owners equity', 'Current liabilities',
       'Other liabilities', 'Total income per employee count',
       'Surplus per employee count', 'Current ratio', 'Quick ratio',
       'Return on equity', 'Return on total assets',
       'Liabilities structure', 'Sales of goods and services',
       'Government funding, grants and subsidies',
       'Additions to fixed assets', 'Disposals of fixed assets',
       'Sales of goods not further processed',
       'Sales of other goods and services',
       'Purchases of goods bought for resale',
       'Other Purchases and operating expenses',
       'Margin on sales of goods for resale',
       'Other purchases and operating expenses'], dtype=object)

####  accessing multiple column

In [22]:
df[["Year","Variable_name"]]

       Year                                    Variable_name
0      2018                                     Total income
1      2018  Sales, government funding, grants and subsidies
2      2018                Interest, dividends and donations
3      2018                             Non-operating income
4      2018                                Total expenditure
...     ...                                              ...
27805  2013                                      Quick ratio
27806  2013              Margin on sales of goods for resale
27807  2013                                 Return on equity
27808  2013                           Return on total assets
27809  2013                            Liabilities structure

[27810 rows x 2 columns]

In [23]:
df.columns

Index(['Year', 'Industry_aggregation_NZSIOC', 'Industry_code_NZSIOC',
       'Industry_name_NZSIOC', 'Units', 'Variable_code', 'Variable_name',
       'Variable_category', 'Value', 'Industry_code_ANZSIC06'],
      dtype='object')

In [24]:
df[["Year","Variable_name","Value"]]

       Year                                    Variable_name   Value
0      2018                                     Total income  691859
1      2018  Sales, government funding, grants and subsidies  605766
2      2018                Interest, dividends and donations   63509
3      2018                             Non-operating income   22583
4      2018                                Total expenditure  597623
...     ...                                              ...     ...
27805  2013                                      Quick ratio      52
27806  2013              Margin on sales of goods for resale      40
27807  2013                                 Return on equity      12
27808  2013                           Return on total assets       5
27809  2013                            Liabilities structure      46

[27810 rows x 3 columns]

In [25]:
type(df[["Year","Variable_name","Value"]])

pandas.core.frame.DataFrame

- df["Year"] - It is a series
- df[["Year"]] - It is a dataframe

In [28]:
# access row with index 133 as a series
df.iloc[133]
# access row with index 133 as a dataframe
df.iloc[[133]]

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
133,2018,Level 3,AA12,"Sheep, Beef Cattle and Grain Farming",Dollars (millions),H20,Non-operating expenses,Financial performance,50,ANZSIC06 groups A014 and A015

In [29]:
df.iloc[133:134]

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
133,2018,Level 3,AA12,"Sheep, Beef Cattle and Grain Farming",Dollars (millions),H20,Non-operating expenses,Financial performance,50,ANZSIC06 groups A014 and A015

In [30]:
df.Value.isnull()

0        False
1        False
2        False
3        False
4        False
         ...
27805    False
27806    False
27807    False
27808    False
27809    False
Name: Value, Length: 27810, dtype: bool

In [31]:
sample=pd.read_csv("sample.csv")
sample

      name   salary  year
0   harshi  25000.0  2019
1  saiteja  30000.0  2015
2    kiran      NaN  2016
3   naseer  40000.0  2015

In [32]:
sample.salary.isna()

0    False
1    False
2     True
3    False
Name: salary, dtype: bool

In [33]:
sample.isnull()

    name  salary   year
0  False   False  False
1  False   False  False
2  False    True  False
3  False   False  False

In [34]:
True+False+True # number of true

2

In [35]:
sample.isna().sum() # default axis = 0

name      0
salary    1
year      0
dtype: int64

In [38]:
sample.isna().sum(axis=1)

0    0
1    0
2    1
3    0
dtype: int64

In [39]:
sample[sample.salary.isna()]

    name  salary  year
2  kiran     NaN  2016

##### to remove columns

In [44]:
sample.drop("salary",axis=1)
# inplace = True will overwrite the original column
# sample =sample.drop('salary',axis=1)

      name  year
0   harshi  2019
1  saiteja  2015
2    kiran  2016
3   naseer  2015

In [45]:
sample

      name   salary  year
0   harshi  25000.0  2019
1  saiteja  30000.0  2015
2    kiran      NaN  2016
3   naseer  40000.0  2015

##### to remove rows

In [47]:
# to remove row with index 1,2
sample.drop([1,2],axis=0)

     name   salary  year
0  harshi  25000.0  2019
3  naseer  40000.0  2015

In [48]:
# to remove row with 0,1
sample.drop(index=[0,1],axis=0)

     name   salary  year
2   kiran      NaN  2016
3  naseer  40000.0  2015

In [49]:
# to remove a single row
sample.drop(3,axis=0)

      name   salary  year
0   harshi  25000.0  2019
1  saiteja  30000.0  2015
2    kiran      NaN  2016

In [50]:
# to remove columns with labels salary and year
sample.drop(['salary','year'],axis=1)

      name
0   harshi
1  saiteja
2    kiran
3   naseer

##### to remove rows with missing values

In [51]:
sample.dropna(axis=1) # removes the columns where we have missing values

      name  year
0   harshi  2019
1  saiteja  2015
2    kiran  2016
3   naseer  2015

In [52]:
sample.salary.dropna()

0    25000.0
1    30000.0
3    40000.0
Name: salary, dtype: float64

#### to fill the missing value with 0

sample.fillna(0) # to fill missing block

In [54]:
sample.salary.fillna(0)

0    25000.0
1    30000.0
2        0.0
3    40000.0
Name: salary, dtype: float64

In [55]:
sample

      name   salary  year
0   harshi  25000.0  2019
1  saiteja  30000.0  2015
2    kiran      NaN  2016
3   naseer  40000.0  2015

In [56]:
# to fill original data
#sample.salary= sample.salary.fillna(0)

##### fill the missin value with mean

In [58]:
m=sample.salary.mean()
print(m)
sample.salary.fillna(m)

31666.666666666668

0    25000.000000
1    30000.000000
2    31666.666667
3    40000.000000
Name: salary, dtype: float64

In [60]:
# total missing value count in the data
sample.isnull().sum().sum()

1

In [61]:
# to get missing value count in a column
sample.salary.isnull().sum()

1

In [62]:
sample

      name   salary  year
0   harshi  25000.0  2019
1  saiteja  30000.0  2015
2    kiran      NaN  2016
3   naseer  40000.0  2015

In [64]:
sample_out=sample.copy()
sample_out['salary']=sample_out.salary.fillna(sample_out.salary.mean())
sample_out

      name        salary  year
0   harshi  25000.000000  2019
1  saiteja  30000.000000  2015
2    kiran  31666.666667  2016
3   naseer  40000.000000  2015

In [67]:
sample_out_rows=sample.dropna()
sample_out_rows

      name   salary  year
0   harshi  25000.0  2019
1  saiteja  30000.0  2015
3   naseer  40000.0  2015

In [68]:
sample_out_cols=sample.dropna(axis=0)
sample_out_cols

      name   salary  year
0   harshi  25000.0  2019
1  saiteja  30000.0  2015
3   naseer  40000.0  2015

In [69]:
dummy=sample.copy()
dummy

      name   salary  year
0   harshi  25000.0  2019
1  saiteja  30000.0  2015
2    kiran      NaN  2016
3   naseer  40000.0  2015

In [70]:
dummy.salary=dummy.salary.mean()
dummy

      name        salary  year
0   harshi  31666.666667  2019
1  saiteja  31666.666667  2015
2    kiran  31666.666667  2016
3   naseer  31666.666667  2015

In [79]:
dummy.salary=dummy.salary.mean
dummy

      name                                             salary  year
0   harshi  <bound method Series.mean of 0    31666.666667...  2019
1  saiteja  <bound method Series.mean of 0    31666.666667...  2015
2    kiran  <bound method Series.mean of 0    31666.666667...  2016
3   naseer  <bound method Series.mean of 0    31666.666667...  2015

In [80]:
s=pd.Series(["avg","good","bad","avg","good"])
pd.get_dummies(s)

   avg  bad  good
0    1    0     0
1    0    0     1
2    0    1     0
3    1    0     0
4    0    0     1

In [81]:
s.nunique()

3

In [82]:
s.unique()

array(['avg', 'good', 'bad'], dtype=object)

In [83]:
sample

      name   salary  year
0   harshi  25000.0  2019
1  saiteja  30000.0  2015
2    kiran      NaN  2016
3   naseer  40000.0  2015

In [84]:
pd.get_dummies(sample)

    salary  year  name_harshi  name_kiran  name_naseer  name_saiteja
0  25000.0  2019            1           0            0             0
1  30000.0  2015            0           0            0             1
2      NaN  2016            0           1            0             0
3  40000.0  2015            0           0            1             0